---
title: Potential Suspicious Access To Sensitive Files
id: 86157017-c2b1-4d4a-8c33-93b8e67e4af4
status: experimental
description: Detects changes of sensitive and critical files. Monitors files that
  you don't expect to change without planning on Linux system.
author: <>
date: 2023/05/30
mitre: T1087/001
tags:
  - attack.T1087/001
logsource:
  product: linux
detection:
  - events:
      - process_exec
    condition: 1 of selection_img* and selection_paths and not selection_wl
    selection_img_1:
      Image|endswith:
        - /cat
        - /echo
        - /grep
        - /head
        - /more
        - /tail
        - /less
    selection_img_2:
      Image|endswith:
        - /emacs
        - /nano
        - /sed
        - /ed
        - /vi
        - /vim
    selection_paths:
      CommandLine|contains:
        - /bin/login
        - /bin/passwd
        - /boot/
        - /etc/*.conf
        - /etc/cron.
        - /etc/crontab
        - /etc/hosts
        - /etc/init.d
        - /etc/sudoers
        - /etc/passwd
        - /etc/shadow
        - /opt/bin/
        - /sbin
        - /usr/bin/
        - /usr/local/bin/
    selection_wl:
      CommandLine|contains:
        - mkinitramfs
        - /etc/locale.conf
        - tmp
        - init.d/cprocsp
        - /dhclient-script
        - bin/apt-key
level: 100
